In [19]:
import pandas as pd
import numpy as np

In [20]:
df = pd.read_excel("employee.xlsx")
df.head(3)

   emp_id first_name last_name  hire_date
0     100     Steven      King 2003-06-17
1     101      Neena   Kochhar 2005-09-21
2     102        Lex   De Haan 2001-01-13

In [21]:
#Q1: 把 first_name = 'Steven' 的 emp_id 改成 88
df.loc[df["first_name"] == 'Steven', "emp_id"] = 88

In [22]:
df.head(3)

   emp_id first_name last_name  hire_date
0      88     Steven      King 2003-06-17
1     101      Neena   Kochhar 2005-09-21
2     102        Lex   De Haan 2001-01-13

In [23]:
#Q2: 列出所有 first_name 首字母為 'S' 的 rows
df[df["first_name"].str.startswith("S")]

    emp_id first_name last_name  hire_date
0       88     Steven      King 2003-06-17
16     116     Shelli     Baida 2005-12-24
17     117      Sigal    Tobias 2005-07-24

In [25]:
#Q3: 把 hire_date 切割成年、月份、日期，並分別新增對應的 columns
df["year"] = df["hire_date"].astype("str").apply(lambda x : x.split("-")[0])
df["month"] = df["hire_date"].astype("str").apply(lambda x : x.split("-")[1])
df['date'] = df['hire_date'].astype("str").apply(lambda x : x.split("-")[2])

In [26]:
df.head(3)

   emp_id first_name last_name  hire_date  year month date
0      88     Steven      King 2003-06-17  2003    06   17
1     101      Neena   Kochhar 2005-09-21  2005    09   21
2     102        Lex   De Haan 2001-01-13  2001    01   13

### Read multiple files

In [28]:
import pandas
import glob
import os

In [33]:
path = "/Users/eve/Desktop/2020桌面/Python_Practice"

In [34]:
file_path = glob.glob(os.path.join(path, "t*.csv"))
file_path

['/Users/eve/Desktop/2020桌面/Python_Practice/test_table3.csv',
 '/Users/eve/Desktop/2020桌面/Python_Practice/test_table2.csv',
 '/Users/eve/Desktop/2020桌面/Python_Practice/test_table.csv',
 '/Users/eve/Desktop/2020桌面/Python_Practice/train.csv']

In [38]:
df_all = pd.concat((pd.read_csv(file) for file in file_path))
len(df_all)

/Users/eve/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

1360854